In [2]:
import pandas as pd
df=pd.DataFrame({'date':['10/2/2011','11/2/2011','12/2/2011','13/2/2011'],
                 'event':['music','poetry','theatre','comedy'],
                 'cost':[10000,5000,1500,2000]})
print(df)

        date    event   cost
0  10/2/2011    music  10000
1  11/2/2011   poetry   5000
2  12/2/2011  theatre   1500
3  13/2/2011   comedy   2000

In [7]:
df['discounted_price']=df.apply(lambda a:a.cost-(a.cost*0.1),axis=1)
df

        date    event   cost  discounted_price
0  10/2/2011    music  10000            9000.0
1  11/2/2011   poetry   5000            4500.0
2  12/2/2011  theatre   1500            1350.0
3  13/2/2011   comedy   2000            1800.0

In [21]:
import pandas as pd
marks={'name':['harish','rakshith','maneesh','vidhya'],
        'maths':[87,28,87,95],
        'it skils':[83,90,84,76]}
df=pd.DataFrame(marks)
display(df)

       name  maths  it skils
0    harish     87        83
1  rakshith     28        90
2   maneesh     87        84
3    vidhya     95        76

In [24]:
df.loc[len(df.index)]=['harish',89,90]
df1=df
df

       name  maths  it skils
0    harish     87        83
1  rakshith     28        90
2   maneesh     87        84
3    vidhya     95        76
4    harish     89        90
5    harish     89        90

In [26]:
df=pd.read_csv("C:\\Users\\GPT BANTWAL\\1.csv")
df

   class  alcohol  malic
0      1    14.23   1.71
1      1    13.20   1.78
2      1    13.16   2.36
3      1    14.37   1.95
4      1    13.24   2.59

In [37]:
import pandas as pd
from sklearn.preprocessing import MinMaxScaler
df=pd.read_csv("C:\\Users\\GPT BANTWAL\\1.csv")
scaling=MinMaxScaler()
scaling.fit_transform(df[['alcohol','malic']])

array([[0.88429752, 0.        ],
       [0.03305785, 0.07954545],
       [0.        , 0.73863636],
       [1.        , 0.27272727],
       [0.0661157 , 1.        ]])

In [39]:
from sklearn.preprocessing import StandardScaler
scaling=StandardScaler()
scaling.fit_transform(df[['alcohol','malic']])

array([[ 1.08997918, -1.07836773],
       [-0.81286583, -0.87324344],
       [-0.88676272,  0.82635788],
       [ 1.3486183 , -0.37508443],
       [-0.73896893,  1.50033771]])

In [31]:
import pandas as pd
import numpy as np
student=pd.read_csv('C:\\Users\\GPT BANTWAL\\marks of studnt-1.csv')
marks=pd.read_csv('C:\\Users\\GPT BANTWAL\\marks.csv')
df_merge=pd.merge(student,marks,on='students id')
df_merge

   students id       sname  m1  m2
0           23     sandhya  45  59
1           11     prathvi  67  80
2           34  prathiksha  78  52
3           12   rashmitha  99  55
4           32     shravya  63  78